Revit 2021.1 API
BindingMap.ReInsert Method
Removes an existing parameter and creates a new binding for a given parameter.
Overload List
Name | Description
ReInsert(Definition, Binding)
Removes an existing parameter and creates a new binding for a given parameter.
ReInsert(Definition, Binding, BuiltInParameterGroup)
Removes an existing parameter and creates a new binding for a given parameter in a specified group.
See Also
BindingMap Class
BindingMap Members
Autodesk.Revit.DB Namespace